# Переборные
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом:

1) Строится двоичная запись числа N.
2) Затем справа дописываются два разряда: символы «01», если число N чётное, и «10», если нечётное.

Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите минимальное число R, большее 130, которое может являться результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.
```
n = int(input())            #Ввод пользователем символов и присваивание их как натуральные числа
r = bin(n)                  #Преобразование символов из 10ой системы в 2ую
print(r)                    #Вывод строки
```
```
n = int(input())            #Ввод пользователем символов и присваивание их как натуральные числа
r = bin(n)[2:]              #Преобразование символов из 10ой системы в 2ую с удалением первых двух символов
print(r)                    #Вывод строки
```
```
n = int(input())            #Ввод пользователем символов и присваивание их как натуральные числа
r = bin(n)[2:]              #Преобразование символов из 10ой системы в 2ую с удалением первых двух символов
print(r)                    #Вывод строки
if n % 2 == 0:              #Если остаток n равен 0
    r += '01'               #прибавить к строке r "01"
else:                       #либо
    r += '10'               #прибавить к строке r "10"
print(r)                    #Вывод строки
```
```
for n in range(1, 100):     #Для n в радиусе от 1 до 100
    r = bin(n)[2:]          #Преобразование символов из 10ой системы в 2ую с удалением первых двух символов
    print(r)                #Вывод строки
    if n % 2 == 0:          #Если остаток n равен 0
        r += '01'           #прибавить к строке r "01"
    else:                   #либо
        r += '10'           #прибавить к строке r "10"
    print(n, r)             #Вывод строки
```
```
for n in range(1, 100):     #Для n в радиусе от 1 до 100
    r = bin(n)[2:]          #Преобразование символов из 10ой системы в 2ую с удалением первых двух символов
    print(r)                #Вывод строки
    if n % 2 == 0:          #Если остаток n равен 0
        r += '01'           #прибавить к строке r "01"
    else:                   #либо
        r += '10'           #прибавить к строке r "10"
    print(n, int(r, 2))     #Вывод строки, r переводится в 10ую систему
```
```
for n in range(1, 100):     #Для n в радиусе от 1 до 100
    r = bin(n)[2:]          #Преобразование символов из 10ой системы в 2ую с удалением первых двух символов
    print(r)                #Вывод строки
    if n % 2 == 0:          #Если остаток n равен 0
        r += '01'           #прибавить к строке r "01"
    else:                   #либо
        r += '10'           #прибавить к строке r "10"
    if int(r, 2) > 130:     #если десятичная r больше 130
        print(int(r, 2))    #Вывод строки, r переводится в 10ую систему
```
